if __name__=='__main__':

    from solver import run_single, run_loop

    cond = dict()
    cond['Speed']   = {}
    cond['Azimuth'] = {}
    
    #################################################################
    # 1. 計算する機体の諸元ファイルを指定する
    #################################################################
    path_config = 'example/rocket_config.csv'
    path_result = 'test'
    # 落下分散の風向・風速条件は以下で指定する
    #################################################################
    cond['Speed']['min']   = 1.     # 最小風速
    cond['Speed']['step']  = 1.     # 何風速刻みで計算するか
    cond['Speed']['num']   = 7      # 何風速分計算するか
    cond['Azimuth']['min'] = 0.     # 風向の最小値[deg]
    cond['Azimuth']['num'] = 8      # 何風向分計算するか
    #################################################################

    print('Hello World!')

    #################################################################
    # 2. 計算するシミュレーションのモードで下の関数を使い分ける
    # 　　（コメントアウトを外す）
    #    run_single() --> 速度、位置などの時間履歴を見る
    #    run_loop()   --> 落下分散図を計算する
    #################################################################
    run_single(path_config, path_result)
    # run_loop(path_config, path_result, cond)